; domain
(define (domain put_task)
 (:requirements :typing :adl)
 (:types
    agent - dummy
    receptacle - dummy
    object -dummy
    receptacle_object - receptacle
    receptacle_object - object
  )

 (:predicates
    (atLocation ?a - agent ?l - receptacle)
    (objectAtLocation ?o - object ?l - receptacle)
    (inReceptacle ?o - object ?r - receptacle)
    (isReceptacleObject ?o - object)
    (holds ?a - agent ?o - object)
    (holdsAny ?a - agent)
    (holdsAnyReceptacleObject ?a - agent)
    (isClean ?o - object)
    (cleanable ?o - object)
    (isHot ?o - object)
    (heatable ?o - object)
    (isCool ?o - object)
    (coolable ?o - object)
    (toggleable ?o - object)
    (isOn ?o - object)
    (isToggled ?o - object)
    (sliceable ?o - object)
    (isSliced ?o - object)
    (isSinkBasin ?r - receptacle)
    (isMicrowave ?r - receptacle)
    (isFridge ?r - receptacle)
    (isKnife ?o - object)
    (isCounterTop ?o - object)
 )

 (:action GotoLocation
    :parameters (?a - agent ?lStart - receptacle ?lEnd - receptacle)
    :precondition (and
            (atLocation ?a ?lStart)
            )
    :effect (and
                (atLocation ?a ?lEnd)
                (not (atLocation ?a ?lStart))
            )
 )



 (:action PickupObjectInReceptacle
    :parameters (?a - agent ?o - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (objectAtLocation ?o ?r)
            (inReceptacle ?o ?r)
            (not (holdsAny ?a))
            )
    :effect (and
                (not (inReceptacle ?o ?r))
                (not (objectAtLocation ?o ?r))
                (holds ?a ?o)
                (holdsAny ?a)
            )
 )

 (:action PickupObjectNoReceptacle
    :parameters (?a - agent ?o - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (objectAtLocation ?o ?r)
            (not (inReceptacle ?o ?r))
            (not (holdsAny ?a))
            )
    :effect (and
                (not (objectAtLocation ?o ?r))
                (holds ?a ?o)
                (holdsAny ?a)
            )
 )

 (:action PutObjectInReceptacle
    :parameters (?a - agent ?o - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (holds ?a ?o)
            (not (holdsAnyReceptacleObject ?a))
            )
    :effect (and
                (inReceptacle ?o ?r)
                (not (holds ?a ?o))
                (not (holdsAny ?a))
                (objectAtLocation ?o ?r)
            )
 )

 (:action PutObjectInReceptacleObject
    :parameters (?a - agent ?o - object ?outerO ?outerR - receptacle)
    :precondition (and
            (atLocation ?a ?outerR)
            (objectAtLocation ?outerO ?outerR)
            (isReceptacleObject ?outerO)
            (not (isReceptacleObject ?o))
            (holds ?a ?o)
            (not (holdsAnyReceptacleObject ?a))
            (inReceptacle ?outerO ?outerR)
            )
    :effect (and
                (inReceptacle ?o ?outerO)
                (inReceptacle ?o ?outerR)
                (not (holds ?a ?o))
                (not (holdsAny ?a))
                (objectAtLocation ?o ?outerR)
            )
 )

 (:action PutReceptacleObjectInReceptacle
    :parameters (?a - agent ?outerO - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (holds ?a ?outerO)
            (holdsAnyReceptacleObject ?a)
            (isReceptacleObject ?outerO)
            )
    :effect (and
                (forall (?obj - object)
                    (when (holds ?a ?obj)
                        (and
                            (not (holds ?a ?obj))
                            (objectAtLocation ?obj ?r)
                            (inReceptacle ?obj ?r)
                        )
                    )
                )
                (not (holdsAny ?a))
                (not (holdsAnyReceptacleObject ?a))
            )
 )

 (:action CleanObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (isSinkBasin ?l)
            (atLocation ?a ?l)
            (holds ?a ?o)
            )
    :effect (and
                (isClean ?o)
            )
 )

 (:action HeatObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (or
                (isMicrowave ?l)
            )
            (atLocation ?a ?l)
            (holds ?a ?o)
            )
    :effect (and
                (isHot ?o)
            )
 )

 (:action CoolObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (or
                (isFridge ?l)
            )
            (atLocation ?a ?l)
            (holds ?a ?o)
            )
    :effect (and
                (isCool ?o)
            )
 )

 (:action ToggleObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (atLocation ?a ?l)
            (objectAtLocation ?o ?l)
            (toggleable ?o)
            )
    :effect (and
                (when (isOn ?o)
                    (not (isOn ?o)))
                (when (not (isOn ?o))
                    (isOn ?o))
                (isToggled ?o)
            )
 )

 (:action SliceObject
    :parameters (?a - agent ?co - object ?ko - object ?l - receptacle)
    :precondition
            (and
                (isKnife ?ko)
                (atLocation ?a ?l)
                (objectAtLocation ?co ?l)
                (sliceable ?co)
                (holds ?a ?ko)
                (isCounterTop ?l)
            )
    :effect (and
                (isSliced ?co)
            )
 )
)

; problem
(define (problem put_KeyChain1_next_to_Bed1_Do_not_move_CellPhone1_11)
  (:domain put_task)
  (:objects
    agent1 - agent
    CellPhone1 - object
    Book1 - object
    CellPhone2 - object
    Pencil2 - object
    KeyChain2 - object
    CreditCard2 - object
    CreditCard1 - object
    Laptop1 - object
    CD1 - object
    Watch1 - object
    KeyChain1 - object
    Pencil1 - object
    Book2 - object
    Pen1 - object
    Sofa2 - receptacle
    Drawer5 - receptacle
    Drawer3 - receptacle
    Drawer1 - receptacle
    Sofa4 - receptacle
    Sofa1 - receptacle
    Desk1 - receptacle
    Bed1 - receptacle
    Drawer2 - receptacle
    Sofa3 - receptacle
    Drawer4 - receptacle
    GarbageCan1 - receptacle
    Sofa5 - receptacle
    Drawer6 - receptacle
    Candle1 - object
    Book3 - object
    Book4 - object
    Book5 - object
    Pen2 - object
    Watch2 - object
    Floor1 - receptacle
    Desk5 - receptacle
  )

  (:init
    (atLocation agent1 Bed1)
    (objectAtLocation KeyChain1 Drawer1)
    (objectAtLocation CellPhone1 Bed1)
    (objectAtLocation Laptop1 Sofa1)
    (objectAtLocation KeyChain2 Sofa2)
    (objectAtLocation Pencil1 GarbageCan1)
    (objectAtLocation CreditCard1 Sofa3)
    (objectAtLocation Pen1 Desk1)
    (objectAtLocation CreditCard2 Drawer2)
    (objectAtLocation Watch1 Drawer3)
    (objectAtLocation CellPhone2 Sofa4)
    (objectAtLocation Book1 Drawer4)
    (objectAtLocation Pencil2 Drawer5)
    (objectAtLocation CD1 Drawer6)
    (objectAtLocation Book2 Sofa5)
    (objectAtLocation Candle1 Drawer1)
    (objectAtLocation Book3 Sofa2)
    (objectAtLocation Book4 Desk1)
    (objectAtLocation Book5 Sofa3)
    (objectAtLocation Pen2 Bed1)
    (objectAtLocation Watch2 Drawer4)
  )

  (:goal
    (and
      (objectAtLocation CellPhone1 Bed1)
      (objectAtLocation KeyChain1 Bed1)
    )
  )
)

; plan
1. (gotolocation agent1 bed1 drawer1)
   deleted: (atlocation agent1 bed1)
   added: (atlocation agent1 drawer1)
   goals met: 1 of 2
2. (pickupobjectnoreceptacle agent1 keychain1 drawer1)
   deleted: (objectatlocation keychain1 drawer1)
   added: (holds agent1 keychain1) (holdsany agent1)
   goals met: 1 of 2
3. (gotolocation agent1 drawer1 bed1)
   deleted: (atlocation agent1 drawer1)
   added: (atlocation agent1 bed1)
   goals met: 1 of 2
4. (putobjectinreceptacle agent1 keychain1 bed1)
   deleted: (holds agent1 keychain1) (holdsany agent1)
   added: (inreceptacle keychain1 bed1) (objectatlocation keychain1 bed1)
   goals met: 2 of 2
